# COGS 108 - Data Checkpoint

# Names

- Tyler Le
- Aditya Tomar
- William Lynch
- Michael Mao
- Natalie Quach

<a id='research_question'></a>
# Research Question

*Fill in your research question here*

# Dataset(s)

*Fill in your dataset information here*

(Copy this information for each dataset)
- Dataset Name:
- Link to the dataset:
- Number of observations:

1-2 sentences describing each dataset. 

If you plan to use multiple datasets, add 1-2 sentences about how you plan to combine these datasets.

# Setup

In [3]:
import pandas as pd

# Data Cleaning

Describe your data cleaning steps here.

In [23]:
df = pd.read_csv("datasets/housing_price_estimates.csv")

#dfRange will give the Price of homes in set ranges, may make it easier to implement in a visual
df['2021'] = df['Price-RangeQ22021']
df['2020'] = df['Price-RangeQ32020']
df['2019'] = df['Price-RangeQ42019']
df['2018'] = df['Price-RangeQ32018']

dfRange = df[['Geography', 'State', '2018', '2019', '2020', '2021']]

dfRange

,Geography,State,2018,2019,2020,2021
0,"Autauga County, Alabama",Alabama,"Less than $150,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"
1,"Baldwin County, Alabama",Alabama,"$150,000-$350,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"
2,"Barbour County, Alabama",Alabama,"Less than $150,000","Less than $150,000","Less than $150,000","Less than $150,000"
3,"Bibb County, Alabama",Alabama,"Less than $150,000","Less than $150,000","Less than $150,000","Less than $150,000"
4,"Blount County, Alabama",Alabama,"Less than $150,000","Less than $150,000","Less than $150,000","Less than $150,000"
...,...,...,...,...,...,...
3115,"Teton County, Wyoming",Wyoming,"$750,000-$1,000,000","$750,000-$1,000,000","$750,000-$1,000,000","$750,000-$1,000,000"
3116,"Uinta County, Wyoming",Wyoming,"$150,000-$350,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"
3117,"Washakie County, Wyoming",Wyoming,"$150,000-$350,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"
3118,"Weston County, Wyoming",Wyoming,"$150,000-$350,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"
3119,"Laramie County, Wyoming",Wyoming,"$150,000-$350,000","$150,000-$350,000","$150,000-$350,000","$150,000-$350,000"

In [24]:
#dfExcact will be the exact home price estimate.  Combining quarters into years for ease of reading
df['County & State'] = df['Geography']
df['2016'] = (df['Q1 2016'] + df['Q4 2016'] + df['Q2 2016'])/3
df['2017'] = (df['Q12017'] + df['Q2 2017 Price'])/2
df['2018'] = (df['Q1 2018'] + df['Q2 2018'] + df['Q3 2018'])/3
df['2019'] = (df['Q42019 Price'])
df['2020'] = (df['Q4 2020 Price'])
df['2021'] = (df['Q1 2021'])
dfExact = df[['County & State','2016','2018', '2017', '2019', '2020', '2021']]

dfExact
#dfExact.to_csv("HousingPrice16-21")

,County & State,2016,2018,2017,2019,2020,2021
0,"Autauga County, Alabama",143.743333,145.643333,72006.102900,"$153,716","$161,743","$163,383"
1,"Baldwin County, Alabama",179.290000,190.250000,92565.987900,"$209,494","$234,357","$238,582"
2,"Barbour County, Alabama",179.290000,190.250000,48762.358895,"$100,423","$95,277","$96,994"
3,"Bibb County, Alabama",177.076667,193.460000,58871.177650,"$101,799","$98,445","$99,436"
4,"Blount County, Alabama",177.076667,193.460000,68658.336200,"$131,548","$135,574","$136,938"
...,...,...,...,...,...,...,...
3115,"Teton County, Wyoming",242.020000,253.040000,373958.811000,"$867,907","$900,218","$915,682"
3116,"Uinta County, Wyoming",242.020000,253.040000,95994.646000,"$186,190","$181,789","$184,911"
3117,"Washakie County, Wyoming",242.020000,253.040000,87367.928000,"$170,665","$172,232","$175,190"
3118,"Weston County, Wyoming",242.020000,253.040000,96808.496800,"$178,218","$172,751","$175,719"
3119,"Laramie County, Wyoming",221.603333,245.980000,110940.700900,"$262,044","$284,317","$290,164"

In [25]:
#Need to read all the CPI files for each region
df_NY = pd.read_csv("datasets/CPI Regions/CPINY.csv")
df_SOUTH = pd.read_csv("datasets/CPI Regions/CPISOUTH.csv")
df_ATL = pd.read_csv("datasets/CPI Regions/CPIAtl.csv")
df_VA_MD_WV = pd.read_csv("datasets/CPI Regions/CPIDC-VA-MD-WV.csv")
df_MID = pd.read_csv("datasets/CPI Regions/CPIMidwest.csv")
df_IL_IN_WI = pd.read_csv("datasets/CPI Regions/CPIIL-IN-WI.csv")
df_WEST = pd.read_csv("datasets/CPI Regions/CPIWest.csv")
df_LOS = pd.read_csv("datasets/CPI Regions/CPILA.csv")
df_SF = pd.read_csv("datasets/CPI Regions/CPISanFran.csv")
df_PA_NJ_DE_MD = pd.read_csv("datasets/CPI Regions/CPIPA-NJ-DE-MD.csv")
df_NORTHEAST = pd.read_csv("datasets/CPI Regions/CPINORTHEAST.csv")

In [26]:
#We want to just see the annual ammount, we dont care for each month
df_NY = df_NY[['Year', 'Annual']]
df_SOUTH = df_SOUTH[['Year', 'Annual']]
df_ATL = df_ATL[['Year', 'Annual']]
df_VA_MD_WV = df_VA_MD_WV[['Year', 'Annual']]
df_MID = df_MID[['Year', 'Annual']]
df_IL_IN_WI = df_IL_IN_WI[['Year', 'Annual']]
df_WEST = df_WEST[['Year', 'Annual']]
df_LOS = df_LOS[['Year', 'Annual']]
df_SF = df_SF[['Year', 'Annual']]
df_PA_NJ_DE_MD = df_PA_NJ_DE_MD[['Year', 'Annual']]
df_NORTHEAST = df_NORTHEAST[['Year', 'Annual']]

In [13]:
df_NY
df_SOUTH
df_ATL 
df_VA_MD_WV
df_MID
df_IL_IN_WI
df_WEST
df_LOS
df_SF
df_PA_NJ_DE_MD
df_NORTHEAST

    Year   Annual
0   1987  116.000
1   1988  121.800
2   1989  128.600
3   1990  136.300
4   1991  142.500
5   1992  147.300
6   1993  151.400
7   1994  155.100
8   1995  159.100
9   1996  163.600
10  1997  167.600
11  1998  170.000
12  1999  173.500
13  2000  179.400
14  2001  184.400
15  2002  188.200
16  2003  193.500
17  2004  200.200
18  2005  207.500
19  2006  215.000
20  2007  220.512
21  2008  229.306
22  2009  229.343
23  2010  233.868
24  2011  240.997
25  2012  245.698
26  2013  249.038
27  2014  252.463
28  2015  252.185
29  2016  254.850
30  2017  259.538
31  2018  265.139
32  2019  269.392
33  2020  272.908
34  2021  283.557

In [27]:
df_SOUTH

    Year   Annual
0   1987  112.400
1   1988  116.400
2   1989  121.500
3   1990  127.900
4   1991  132.900
5   1992  136.500
6   1993  140.800
7   1994  144.700
8   1995  149.000
9   1996  153.600
10  1997  156.900
11  1998  158.900
12  1999  162.000
13  2000  167.200
14  2001  171.100
15  2002  173.300
16  2003  177.300
17  2004  181.800
18  2005  188.300
19  2006  194.700
20  2007  200.361
21  2008  208.681
22  2009  207.845
23  2010  211.338
24  2011  218.618
25  2012  223.242
26  2013  226.721
27  2014  230.552
28  2015  230.147
29  2016  232.692
30  2017  237.456
31  2018  242.737
32  2019  246.265
33  2020  248.639
34  2021  261.259

In [28]:
df_ATL

    Year   Annual
0   1987  116.500
1   1988  120.400
2   1989  126.100
3   1990  131.700
4   1991  135.900
5   1992  138.500
6   1993  143.400
7   1994  146.700
8   1995  150.900
9   1996  156.000
10  1997  158.900
11  1998  161.200
12  1999  164.800
13  2000  170.600
14  2001  176.200
15  2002  178.200
16  2003  180.800
17  2004  183.200
18  2005  188.900
19  2006  193.800
20  2007  200.011
21  2008  206.454
22  2009  200.996
23  2010  203.468
24  2011  209.102
25  2012  212.782
26  2013  216.267
27  2014  220.969
28  2015  221.631
29  2016  225.463
30  2017  232.887
31  2018  238.577
32  2019  243.731
33  2020  246.653
34  2021  261.633

In [29]:
df_VA_MD_WV

    Year   Annual
0   1987  116.200
1   1988  121.000
2   1989  128.000
3   1990  135.600
4   1991  141.200
5   1992  144.700
6   1993  149.300
7   1994  152.200
8   1995  155.300
9   1996  159.600
10  1997  162.400
11  1998      NaN
12  1999      NaN
13  2000      NaN
14  2001      NaN
15  2002      NaN
16  2003      NaN
17  2004      NaN
18  2005      NaN
19  2006      NaN
20  2007      NaN
21  2008      NaN
22  2009      NaN
23  2010      NaN
24  2011      NaN
25  2012      NaN
26  2013      NaN
27  2014      NaN
28  2015  250.664
29  2016  253.422
30  2017  256.221
31  2018  261.445
32  2019  264.777
33  2020  267.157
34  2021  277.728

In [30]:
df_MID

    Year   Annual
0   1987  111.900
1   1988  116.100
2   1989  121.500
3   1990  127.400
4   1991  132.400
5   1992  136.100
6   1993  140.000
7   1994  144.000
8   1995  148.400
9   1996  153.000
10  1997  156.700
11  1998  159.300
12  1999  162.700
13  2000  168.300
14  2001  172.800
15  2002  174.900
16  2003  178.300
17  2004  182.600
18  2005  188.400
19  2006  193.000
20  2007  198.123
21  2008  205.382
22  2009  204.064
23  2010  208.046
24  2011  214.743
25  2012  219.100
26  2013  222.170
27  2014  225.425
28  2015  224.210
29  2016  226.115
30  2017  229.874
31  2018  234.290
32  2019  237.776
33  2020  240.040
34  2021  252.242

In [31]:
df_IL_IN_WI

    Year   Annual
0   1987  114.500
1   1988  119.000
2   1989  125.000
3   1990  131.700
4   1991  137.000
5   1992  141.100
6   1993  145.400
7   1994  148.600
8   1995  153.300
9   1996  157.400
10  1997  161.700
11  1998  165.000
12  1999  168.400
13  2000  173.800
14  2001  178.300
15  2002  181.200
16  2003  184.500
17  2004  188.600
18  2005  194.300
19  2006  198.300
20  2007  204.818
21  2008  212.536
22  2009  209.995
23  2010  212.870
24  2011  218.684
25  2012  222.005
26  2013  224.545
27  2014  228.468
28  2015  227.792
29  2016  229.302
30  2017  233.611
31  2018  237.706
32  2019  241.181
33  2020  243.873
34  2021  254.159

In [32]:
df_WEST

    Year   Annual
0   1987  114.300
1   1988  119.000
2   1989  124.600
3   1990  131.500
4   1991  137.300
5   1992  142.000
6   1993  146.200
7   1994  149.600
8   1995  153.500
9   1996  157.600
10  1997  161.400
11  1998  164.400
12  1999  168.900
13  2000  174.800
14  2001  181.200
15  2002  184.700
16  2003  188.600
17  2004  193.000
18  2005  198.900
19  2006  205.700
20  2007  212.230
21  2008  219.646
22  2009  218.822
23  2010  221.203
24  2011  227.485
25  2012  232.376
26  2013  235.824
27  2014  240.215
28  2015  243.015
29  2016  247.705
30  2017  254.738
31  2018  263.263
32  2019  270.350
33  2020  275.057
34  2021  287.494

In [33]:
df_LOS

    Year   Annual
0   1987  116.700
1   1988  122.100
2   1989  128.300
3   1990  135.900
4   1991  141.400
5   1992  146.500
6   1993  150.300
7   1994  152.300
8   1995  154.600
9   1996  157.500
10  1997  160.000
11  1998  162.300
12  1999  166.100
13  2000  171.600
14  2001  177.300
15  2002  182.200
16  2003  187.000
17  2004  193.200
18  2005  201.800
19  2006  210.400
20  2007  217.338
21  2008  225.008
22  2009  223.219
23  2010  225.894
24  2011  231.928
25  2012  236.648
26  2013  239.207
27  2014  242.434
28  2015  244.632
29  2016  249.246
30  2017  256.210
31  2018  265.962
32  2019  274.114
33  2020  278.567
34  2021  289.244

In [34]:
df_SF

    Year   Annual
0   1987  115.400
1   1988  120.500
2   1989  126.400
3   1990  132.100
4   1991  137.900
5   1992  142.500
6   1993  146.300
7   1994  148.700
8   1995  151.600
9   1996  155.100
10  1997  160.400
11  1998  165.500
12  1999  172.500
13  2000  180.200
14  2001  189.900
15  2002  193.000
16  2003  196.400
17  2004  198.800
18  2005  202.700
19  2006  209.200
20  2007  216.048
21  2008  222.767
22  2009  224.395
23  2010  227.469
24  2011  233.390
25  2012  239.650
26  2013  245.023
27  2014  251.985
28  2015  258.572
29  2016  266.344
30  2017  274.924
31  2018  285.550
32  2019  295.004
33  2020  300.084
34  2021  309.721

In [35]:
df_PA_NJ_DE_MD

    Year   Annual
0   1987  116.800
1   1988  122.400
2   1989  128.300
3   1990  135.800
4   1991  142.200
5   1992  146.600
6   1993  150.200
7   1994  154.600
8   1995  158.700
9   1996  162.800
10  1997  166.500
11  1998  168.200
12  1999  171.900
13  2000  176.500
14  2001  181.300
15  2002  184.900
16  2003  188.800
17  2004  196.500
18  2005  204.200
19  2006  212.100
20  2007  216.743
21  2008  224.131
22  2009  223.288
23  2010  227.715
24  2011  233.809
25  2012  238.097
26  2013  240.900
27  2014  244.050
28  2015  243.858
29  2016  245.290
30  2017  248.423
31  2018  251.563
32  2019  256.621
33  2020  258.923
34  2021  269.371

In [36]:
df_NORTHEAST

    Year   Annual
0   1987  116.000
1   1988  121.800
2   1989  128.600
3   1990  136.300
4   1991  142.500
5   1992  147.300
6   1993  151.400
7   1994  155.100
8   1995  159.100
9   1996  163.600
10  1997  167.600
11  1998  170.000
12  1999  173.500
13  2000  179.400
14  2001  184.400
15  2002  188.200
16  2003  193.500
17  2004  200.200
18  2005  207.500
19  2006  215.000
20  2007  220.512
21  2008  229.306
22  2009  229.343
23  2010  233.868
24  2011  240.997
25  2012  245.698
26  2013  249.038
27  2014  252.463
28  2015  252.185
29  2016  254.850
30  2017  259.538
31  2018  265.139
32  2019  269.392
33  2020  272.908
34  2021  283.557

In [37]:
#Writing the newly cleaned data to new csv
#df_NY.to_csv("NY")
#df_SOUTH.to_csv("SOUTH")
#df_ATL.to_csv("ATL")
#df_VA_MD_WV.to_csv("VA-MD-WV")
#df_MID.to_csv("MIDWEST")
#df_IL_IN_WI.to_csv("IL-IN-WI")
#df_WEST.to_csv("WEST")
#df_LOS.to_csv("LOS")
#df_SF.to_csv("SF")
#df_PA_NJ_DE_MD.to_csv("PA-NJ-DE-MD")
#df_NORTHEAST.to_csv("NORTHEAST")